[
  {
    "Name": "Meld Owner Hub",
    "Slug": "owner-hub",
    "50 Character Description": "The Control Center for a Property Owner’s Maintenance Operations",
    "Startup Company": "property-meld",
    "Featured": "true",
    "Sort Order": 2,
    "Product Type": "Product",
    "Summary": "This web application equips property owners, whose properties are managed by a property management firm, with the ability to participate in the maintenance process for their properties.",
    "Description": "This web application equips property owners, whose properties are managed by a property management firm, with the ability to participate in the maintenance process for their properties. With the Owner Hub, property owners can approve or reject maintenance requests from tenants, chat with maintenance coordinators regarding ongoing maintenance activities, and view the historical maintenance records for each of their properties. ",
    "Thumbnai Image": "/images/products/owner-hub-thumb.webp",
    "Project Image": "/images/products/owner-hub-project.webp",
    "Start Date": "Jul 01, 2020",
    "End Date": "Jan 01, 2021",
    "Highlights": "<ul id=\"\"><li id=\"\">Achieved higher property owner engagement with a 52% increase in owner communication by leading a cross-functional team to design, build, and launch the Owner Hub as a 0-to-1 product initiative</li></ul><ul><li id=\"\">Achieved 49% adoption from existing property owners, 49% adoption from new customers &amp; 22% adoption from existing customers by coordinating a cross-functional launch of the Meld Owner Hub with marketing, sales, customer success &amp; support teams</li></ul><ul><li id=\"\">Achieved a 2X increase in design &amp; development velocity by coordinating the construction of a Design System &amp; Component Library</li></ul><ul><li id=\"\">Achieved a 91% increase in development velocity by coordinating the product team's transition from waterfall to SCRUM Agile Development alongside our VP of Engineering</li></ul><ul><li id=\"\">Conducted 20+ customer discovery interviews</li></ul>",
    "Press Release": "<blockquote id=\"\">PROPERTY MELD ANNOUNCES OWNER HUB TO INCREASE PROPERTY OWNER RETENTION FOR SINGLE-FAMILY PROPERTY MANAGEMENT FIRMS.</blockquote><blockquote id=\"\"><em id=\"\">Now, property management firms that use Property Meld to automate their maintenance operations can increase customer retention by providing their property owners with Owner Hub, empowering them to participate in the maintenance operations of their properties.</em></blockquote><blockquote id=\"\">Rapid City, South Dakota—Q1 2021—Property Meld, the leading maintenance management solution for single-family rental property management firms, released Owner Hub to help them increase property owner retention.</blockquote><blockquote id=\"\">Property owners, especially those with multiple properties, often face confusion and frustration due to overwhelming and unclear maintenance-related communication from their property manager. The result is that owners do not feel confident that their properties' maintenance issues are properly handled, leading them to unexpectedly call their property manager or distrust their property manager and eventually churn.</blockquote><blockquote id=\"\">\"Our customers expect us to help them win in the current competitive landscape… and we make it our mission to keep the gap between them and would-be competitors incredibly wide. Thus, we are helping our customers build trust with their customers with Owner Hub.\" - Ray Hespen, Co-founder and CEO at Property Meld.</blockquote><blockquote id=\"\">The Owner Hub is a web application designed specifically for property owners whose properties are managed by a property management firm using Property Meld. With the Owner Hub, property owners can approve or reject maintenance requests from tenants, chat with tenants regarding ongoing maintenance activities, configure their notification settings, and view the historical maintenance records for each property.</blockquote><blockquote id=\"\">\"With Property Meld's Owner Hub, our owners have felt they have more visibility into their maintenance activities, decreasing the time and effort invested in mitigating their concerns.\" - John Doe, President at ABC Property Management.</blockquote><blockquote id=\"\">Today's release of Property Meld's Owner Hub is the first step towards building trust between property managers and owners. It is the foundation for our team's engineers to continue adding features that enhance the maintenance experience for both property managers and owners.</blockquote><blockquote id=\"\">Learn more at <a href=\"https://propertymeld.com/\" id=\"\">propertymeld.com</a> or contact our team at <a href=\"http://email:support@propertymeld.com\" id=\"\">support@propertymeld.com</a>.</blockquote>",
    "Website": "Help Center Documentation",
    "Live Link": "https://help.propertymeld.com/hc/en-us/articles/1500002555281-Owner-Hub-Overview-Owner#:~:text=Owners%20are%20able%20to,invited%20to%20the%20Owner%20Hub.",
    "Tags": [
      "property-tech",
      "b2b",
      "saas",
      "web-application"
    ],
    "Demo Video": "https://youtu.be/3qow6q1uTXQ",
    "Skills": [
      "execution",
      "prioritization",
      "customer-research",
      "communication",
      "product-launches-and-marketing",
      "data-analysis",
      "design"
    ]
  },
  {
    "Name": "PropertyCare+",
    "Slug": "propertycareplus",
    "50 Character Description": "A property owner’s self-service e-catalog of premium maintenance services",
    "Startup Company": "property-meld",
    "Featured": "false",
    "Sort Order": 1,
    "Product Type": "Product",
    "Summary": "This product helps property managers build trust with their customers by equipping them with the ability to offer premium maintenance services al-la-carte through a self-service e-commerce-like catalog within the Meld Owner Hub.",
    "Description": "This product helps property managers build trust with their customers by equipping them with the ability to offer premium maintenance services al-la-carte, such as HVAC inspections, annual water heater flushes, gutter cleanings, and more, through a self-service e-commerce-like catalog within the Meld Owner Hub.",
    "Thumbnai Image": "/images/products/propertycareplus-thumb.webp",
    "Project Image": "/images/products/propertycareplus-project.webp",
    "Start Date": "Dec 01, 2021",
    "End Date": "May 01, 2022",
    "Highlights": "<ul id=\"\"><li id=\"\">Led a cross-functional team to design and launch PropertyCare+</li></ul><ul><li id=\"\">Assisted in raising a Series B of $15 million by crafting a portion of the messaging used to pitch Property Meld's product vision and show how PropertyCare+ fits into our long-term product strategy</li></ul><ul><li id=\"\">Conducted 10+ customer discovery interviews </li></ul>",
    "Press Release": "<blockquote id=\"\">PROPERTY MELD ANNOUNCES PROPERTYCARE+ TO INCREASE PROPERTY OWNER RETENTION FOR SINGLE-FAMILY PROPERTY MANAGEMENT FIRMS.</blockquote><blockquote id=\"\"><em id=\"\">Now, property management firms can increase customer retention and their maintenance profit margins by offering al-la-carte premium maintenance services to property owners with PropertyCare+.</em></blockquote><blockquote id=\"\">Rapid City, South Dakota—Q2 2022—Property Meld, the leading maintenance management solution for single-family property management firms, released PropertyCare+ to help them increase customer retention and maintenance profit margins.</blockquote><blockquote id=\"\">Property owners—a property management firm's customers—are often worried about the health of their properties, unwilling to have faith that their property manager will adequately address routine and recurring maintenance that prevents more significant issues from arising. On the other hand, property managers are often too busy and need more time to ask their owners if they are interested in premium preventative maintenance services. The result is that both parties, property owners and property managers, are hurting. The property owners distrust their property managers, and the property management firm is leaving money on the table by not performing these additional services for their owners. </blockquote><blockquote id=\"\">\"Our customers expect us to help them build trust with property owners, aka their customers... and we make it our mission to ensure that property owners have no room to question their property manager's ability to care for their properties. Thus, we are helping our customers build trust with their customers by easily offering al-la-carte premium maintenance services.\" - Ray Hespen, Co-founder and CEO at Property Meld.</blockquote><blockquote id=\"\">PropertyCare+ equips property managers with the ability to offer premium maintenance services al-la-carte to their customers through a self-service e-commerce-like experience within Property Meld's Owner Hub. Additional service offerings can include recurring issues like lawn care, annual preventative maintenance measures like flushing a water heater to increase lifespan, annual HVAC inspections, or seasonal gutter cleanings. If an owner opts into a service, a Meld task is automatically created in Property Meld and assigned to the right team to be addressed. </blockquote><blockquote id=\"\">\"We've had a significant portion of our owners sign up for additional maintenance services. It works out great for us and our owners because we can complete these services during the slow seasons and reduce the number of emergency issues during the busy seasons.\" - John Doe, President at ABC Property Management.</blockquote><blockquote id=\"\">With PropertyCare+, property managers increase their profit margins by increasing the maintenance performed per property and decreasing customer churn by helping property owners see that their properties have the best care, both before and after issues arise.</blockquote><blockquote id=\"\">Learn more at <a href=\"https://propertymeld.com/\" id=\"\">propertymeld.com</a> or contact our team at <a href=\"support@propertymeld.com\" id=\"\">support@propertymeld.com</a>. </blockquote>",
    "Skills": [
      "communication",
      "customer-research",
      "execution",
      "prioritization",
      "product-strategy",
      "product-launches-and-marketing"
    ]
  },
  {
    "Name": "Verbaly",
    "Slug": "verbaly-web-app",
    "50 Character Description": "The AI Speech Coach to Replace Toastmasters",
    "Startup Company": "verbaly",
    "Featured": "true",
    "Sort Order": 4,
    "Product Type": "Product",
    "Summary": "This consumer web application offers a humanized AI speech coach that records, evaluates, and trains its users to communicate effectively during presentations, job interviews, critical workplace conversations, small talk, sales calls, and more.",
    "Description": "This consumer web application offers a humanized AI speech coach that records, evaluates, and trains its users to communicate effectively during presentations, job interviews, critical workplace conversations, small talk, sales calls, and more.",
    "Thumbnai Image": "/images/products/verbaly-web-app-thumb.webp",
    "Project Image": "/images/products/verbaly-web-app-project.webp",
    "Start Date": "Apr 01, 2023",
    "End Date": "Jul 01, 2023",
    "Highlights": "<ul id=\"\"><li id=\"\">Acquired 2300+ users and $XX in weekly recurring revenue by designing and launching a consumer web app that leveraged Large Language Models (LLMs) and a Retrieval Augmented Generation (RAG) System</li></ul><ul><li id=\"\">Raised $25K from Jason Calacanis and LAUNCH as a convertible note by pitching to the LAUNCH investment team</li></ul><ul><li id=\"\">Conducted 70+ customer discovery interviews, competitor analysis, and other key research</li></ul><ul><li id=\"\">Designed and built the front end of Verbaly’s web app (app.verbaly.ai) using Bubble.io and v1 of Verbaly’s sales website using Squarespace</li></ul><ul><li id=\"\">Pursued Product-Market-Fit (PMF) by analyzing user behavior through Logrocket screen recordings, 3rd-party event tracking, and customer interviews, resulting in the release of various experimental features: Speech Analysis Engine, AI Speech Coach Chatbot, AI-conducted Mock Interviews, AI-conducted Investor Pitch with Q&amp;A, Mock Small Talk Conversations with an AI</li></ul><ul><li id=\"\">Acquired 700+ (of 2300+) users by leveraging growth hacking techniques to get unpaid mentions in notable industry newsletters (The Rundown AI, Futurepedia, AI Tools Club, etc.)</li></ul><ul><li id=\"\">Acquired 600+ (of 2300+) users by conducting digital marketing campaigns on Twitter and LinkedIn </li></ul><ul><li id=\"\">Established a partnership with StuPo, a student portal provider for universities in India, and released a white-labeled AI Mock Interview tool on their platform for university students at VNIT</li></ul>",
    "Press Release": "<blockquote id=\"\">VERBALY ANNOUNCES THE LAUNCH OF ITS AI-POWERED SPEECH COACH.</blockquote><blockquote id=\"\"><em id=\"\">Now, professionals with low confidence and ineffective communication skills can have a personal AI speech coach at their fingertips to help them prepare, practice, and refine their verbal communication skills.</em></blockquote><blockquote id=\"\">San Francisco, California—Q3 2023—Verbaly, the AI speech coach to replace Toastmasters, provides real-time feedback to its users so that they can improve their communication skills. As a result, they gain confidence and learn to communicate their ideas, arguments, and questions more effectively.</blockquote><blockquote id=\"\">Professionals across all industries are afflicted with low confidence and poor communication skills, especially those new to management or non-native English speakers. To stand out in the workforce, these individuals must communicate confidently and effectively during job interviews, conversations with colleagues, negotiations with clients, presentations to their leaders, etc. Minor communication blunders naturally erode the trust between them and their peers over time, resulting in missed opportunities, misalignment on projects, and failure to perform the jobs they were hired for.</blockquote><blockquote id=\"\">Toastmasters exists to help these professionals learn how to communicate effectively and gain confidence; however, its groups are plagued with sensitive egos, internal drama, and unhelpful politics, hindering its members from accomplishing their career goals. </blockquote><blockquote id=\"\">“People naturally fear environments where they could encounter shame, which is why less than 5% of first and second-time Toastmasters attendees become members. Unlike many Toastmasters clubs, you won’t see toxic behavior in your AI speech coach.” - Bill Trevillyan, Co-founder and CEO at Verbaly.</blockquote><blockquote id=\"\">For $20 per month, users can prepare, practice, and refine their verbal communication skills by speaking in a wide variety of environments, such as giving a speech, participating in a mock job interview with an AI-simulated hiring manager, practicing small talk with an AI-simulated colleague or delivering a pitch to an AI-simulated investor.</blockquote><blockquote id=\"\">As users of Verbaly practice speaking, our communication analysis technology analyzes their speech patterns. As a result, users receive detailed feedback on aspects of their communication, such as filler-word usage, vocab sophistication, pacing, and tone. More importantly, users are evaluated on how effectively they communicate with the help of our proprietary communication framework. With this framework, users are graded by how well they are able to inform, persuade, instruct, motivate, and express themselves to their audience. This novel approach to analyzing a person’s communication helps them understand if they have successfully achieved their goals and effectively communicated what they needed to.</blockquote><blockquote id=\"\">“I finally feel confident when presenting to executives. Thank you, Verbaly!” - Jane Doe, Manager at ABC Company.</blockquote><blockquote id=\"\">Learn more at <a href=\"http://Verbaly.AI\" id=\"\">Verbaly.AI</a> or contact our team at <a href=\"info@verably.ai\" id=\"\">info@verably.ai</a>.</blockquote>",
    "Services Text": "<h2 id=\"\"><strong id=\"\">Wireframes</strong></h2><p>‍</p><p id=\"\">In this section, we offer a glimpse into the conceptualization phase of our projects through wireframes. Wireframes are the architectural blueprints of digital experiences, representing the foundation upon which we build remarkable websites. Here, you can explore our thoughtfully crafted wireframes that lay the groundwork for seamless and user-friendly designs.</p><p>‍</p><h2 id=\"\"><strong id=\"\">Highlights:</strong></h2><p>‍</p><ol id=\"\"><li><strong id=\"\">User-Centric Design:</strong> Our wireframes prioritize user experience, mapping out intuitive navigation, content hierarchy, and interaction points that put users at the forefront of design.</li><li><strong id=\"\">Responsive Blueprint:</strong> We've meticulously planned for responsiveness, ensuring that our designs adapt seamlessly to various screen sizes, guaranteeing a consistent experience on desktops, tablets, and mobile devices.</li><li><strong id=\"\">Strategic Content Placement:</strong> Our wireframes reveal the strategic placement of content, imagery, and call-to-action elements, optimizing engagement and conversion pathways.</li><li><strong id=\"\">Iterative Refinement:</strong> Crafting these wireframes involved numerous iterations and collaborative feedback sessions to ensure they perfectly aligned with our client's vision and objectives.</li></ol><p>‍</p><h2 id=\"\"><strong id=\"\">Challenges</strong></h2><p>‍</p><p id=\"\">In this section, we provide an insightful look into the challenges we encountered during the development journey of our client projects. Challenges are opportunities in disguise, and it's in these moments that our team's expertise and problem-solving abilities truly shine.</p><p>‍</p><p id=\"\"><strong id=\"\">Notable Challenges:</strong></p><p>‍</p><ol id=\"\"><li><strong id=\"\">Complex Functionality:</strong> Our clients often demand intricate functionalities, such as e-commerce integration and custom user dashboards, which require innovative solutions and rigorous testing.</li><li><strong id=\"\">Performance Optimization:</strong> Achieving top-tier performance while maintaining feature-rich websites necessitates extensive optimization, including image compression, code refinement, and server-side enhancements.</li><li><strong id=\"\">Security Prioritization:</strong> Data privacy and cybersecurity are paramount. We implemented robust security measures to safeguard sensitive user information, ensuring a safe online environment.</li><li><strong id=\"\">Browser Compatibility:</strong> Ensuring that our websites function seamlessly across a multitude of browsers and devices required exhaustive testing and meticulous debugging.</li></ol><p>‍</p><h2 id=\"\"><strong id=\"\">Conclusion</strong></h2><p>‍</p><p id=\"\">In the conclusion segment of our portfolio, we celebrate the successful outcomes of our collaborations with clients. This is where the narrative of our partnerships reaches its apex, spotlighting achievements, milestones, and the profound impact of our work.</p>",
    "Website": "https://app.verbaly.ai/?utm_source=bills_product_portfolio",
    "Tags": [
      "b2c",
      "llms",
      "saas",
      "web-application"
    ],
    "Skills": [
      "execution",
      "prioritization",
      "product-strategy",
      "customer-research",
      "product-launches-and-marketing"
    ]
  },
  {
    "Name": "Incode Analytics",
    "Slug": "incode-analytics",
    "50 Character Description": "The Fraud and Conversion Analytics Dashboard for Banking Enterprises",
    "Startup Company": "incode-technologies",
    "Featured": "true",
    "Sort Order": 3,
    "Product Type": "Product",
    "Summary": "This web application equips financial enterprises—who use Incode’s biometric identity verification solution to minimize fraud and maximize conversion—to analyze the performance of their digital onboarding experiences through embedded analytics dashboards powered by Tableau. ",
    "Description": "This web application equips financial enterprises—who use Incode’s biometric identity verification solution to minimize fraud and maximize conversion—to analyze the performance of their digital onboarding experiences through embedded analytics dashboards powered by Tableau. ",
    "Thumbnai Image": "/images/products/incode-analytics-thumb.webp",
    "Project Image": "/images/products/incode-analytics-project.webp",
    "Start Date": "Sep 01, 2022",
    "End Date": "Jan 01, 2023",
    "Highlights": "<ul id=\"\"><li id=\"\">Decreased a bank’s time-to-proven value by 50% (~3 months) by leading a cross-functional team to build and launch Incode Analytics, leveraging embedded Tableau dashboards with row-level security</li></ul><ul><li id=\"\">Coordinated the development and release of user event tracking of our customer’s users and an associated event log UI for our clients to see what actions each of their users were taking during their onboarding journey and diagnose drop off in the conversion funnel</li></ul><ul><li id=\"\">Led the re-design of Incode's event data architecture related to our clients’ users’ experience after uncovering a serious architecture and definition issue that prevented us from delivering a single instance of an analytics dashboard to all clients</li></ul>",
    "Press Release": "<blockquote id=\"\">INCODE ANNOUNCES INCODE ANALYTICS TO EMPOWER BANKING ENTERPRISES TO VISUALIZE THE PERFORMANCE OF THEIR DIGITAL IDENTITY VERIFICATION SOLUTION.</blockquote><blockquote id=\"\"><em id=\"\">Now, financial enterprises that use Incode's biometric identity verification solution can analyze the performance of their digital onboarding experiences with embedded analytics dashboards powered by Tableau. </em></blockquote><blockquote id=\"\">San Francisco, California—Q4 2022—Incode, the next-generation identity verification and authentication platform for global enterprises, released Incode Analytics to enable both fraud-prevention and user-growth teams with visibility and insights into their digital identity verification implementation's performance</blockquote><blockquote id=\"\">Global enterprises use Incode's biometric identity verification services to increase conversion of their new customer digital onboarding funnels, decrease fraud, and achieve KYC and AML compliance. However, without the ability to quickly visualize the performance of their digital onboarding funnels, various stakeholders suffer. Executives are prevented from comprehending the impact of their biometric identity verification solution on digital onboarding conversion and fraud prevention. Analysts are forced to manually conduct timely funnel analyses and prepare confusion matrices to discover simple insights. Fraud prevention teams are prevented from obtaining valuable insights promptly, and the implementation teams miss vital opportunities to improve their onboarding conversion rates.</blockquote><blockquote id=\"\">Incode Analytics removes this friction by providing an enterprise's various teams and stakeholders with analytics dashboards showing real-time, quantitative insights that are key to understanding the performance of their digital identity verification implementation. Stakeholders ranging from analysts to executives can learn from and quickly make decisions based on KPIs such as onboarding funnel conversion rates, fraud detection rates, and user drop-off rates.</blockquote><blockquote id=\"\"><em id=\"\">\"Staying ahead of ever-smarter fraudsters starts with data that can be simply and quickly utilized. Thus, Incode is making a large step towards ensuring that financial enterprises are well equipped to react fast to the ever-changing identity-tech industry.\"</em> - William Trevillyan, Product Manager at Incode.</blockquote><blockquote id=\"\">With Incode Analytics, users can view a set of embedded Tableau dashboards that show various analyses, such as onboarding funnel analyses, dynamic conversion trends, fraud-focused confusion matrices, and more. Executives can make high-level observations while analysts can dig for deeper insights using 20+ filters.</blockquote><blockquote id=\"\"><em id=\"\">\"I found Incode Analytics allowed our team to observe, experiment, iterate, and learn, accelerating our ability to increase onboarding conversion rates while decreasing fraud.\"</em> - Jane Doe, Head of Growth for ABC Bank.</blockquote><blockquote id=\"\">To learn more, please <a href=\"https://incode.com/contact-us/\" id=\"\">contact our team</a> here at <a href=\"https://incode.com\">Incode</a>.</blockquote>",
    "Skills": [
      "execution",
      "communication",
      "prioritization",
      "customer-research"
    ]
  },
  {
    "Name": "Clip360",
    "Slug": "clip360",
    "50 Character Description": "The Data Dog for Manufacturing Operations",
    "Startup Company": "clip-automation",
    "Featured": "true",
    "Sort Order": 1,
    "Product Type": "Product",
    "Summary": "This product ingests and aggregates machine and sensor telemetry from the factory floor to deliver real-time insights via custom KPIs and analytics dashboards for operators, technicians, engineers, supervisors and leadership. ",
    "Description": "This product ingests and aggregates machine and sensor telemetry from the factory floor to deliver real-time insights via custom KPIs and analytics dashboards for operators, technicians, engineers, supervisors and leadership. ",
    "Thumbnai Image": "/images/products/clip360-thumb.webp",
    "Project Image": "/images/products/clip360-project.webp",
    "Start Date": "Jan 08, 2025",
    "End Date": "Dec 18, 2025",
    "Highlights": "<p>•\tAcquired $XXXK in ARR from a Fortune 100 corporation by hiring and coordinating an engineering team of 5 to deliver an <strong>industrial observability platform </strong>for manufacturing operations</p>",
    "Press Release": "<blockquote>CLIP AUTOMATION ANNOUNCES CLIP OBSERVABILITY TO DELIVER REAL-TIME MONITORING FOR OPERATIONS TEAMS</blockquote><blockquote><em>Now, third-party logistics and manufacturing enterprises that utilize Clip Automation’s Industrial Data Platform can remotely monitor logistics or manufacturing operations for each machine, cell, line, or site in real-time.</em></blockquote><blockquote>Palo Alto, CA - November 2025,<strong> </strong>Clip Automation, the real-time industrial observability platform for manufacturing enterprises, announced Clip Observability, providing real-time dashboards that empower operators on the floor, engineers in the control room, and executives at headquarters to monitor operations on-site or remotely. In one shot, these dashboards provide a state of the union, surface critical issues that require attention, and reveal insights needed to make key decisions.</blockquote><blockquote>Operations teams face critical visibility challenges that reduce throughput, uptime, and quality. <strong>Operators</strong> and <strong>technicians</strong> struggle with fragmented information sources—checking individual machine HMIs, fielding radio calls, and walking between cells—resulting in delayed responses to equipment failures, quality issues, and bottlenecks that cascade into significant production losses. <strong>Engineers</strong> and <strong>supervisors</strong> face greater obstacles: existing SCADA systems provide basic equipment states with alarms, but lack contextual KPIs, leading to manual data aggregation in massive Excel reports to understand cycle time distributions, product evaluation distributions, and version heat maps. Engineers learn about systemic issues—such as a cleaning cell creating downstream test failures—only after reviewing end-of-shift or day reports, when corrective action is too late. <strong>Executives</strong> lack unified dashboards across facilities, relying on delayed, inconsistent manual reports and anecdotal explanations rather than live data showing comparative performance. This information vacuum prevents data-driven resource allocation and continuous improvement, leaving organizations operating blind and reacting to problems after they occur.</blockquote><blockquote>Clip Observability provides each stakeholder with precisely the information they need to act. Operators see live machine states, key alerts and warnings, and production rates for immediate troubleshooting via 72” floor displays. Supervisors and engineers monitor process and line-level performance with KPIs—utilization, throughput, performance, quality, availability, and error rates—spotting trends and intervening before goals slip. Executives access aggregated OEE, utilization, and throughput across facilities for strategic decision-making and cross-site benchmarking.</blockquote><blockquote>“Operations teams are flying blind—wasting hours chasing scattered data and missing critical issues across their lines. We built Clip Observability to bring actionable visibility to every level of manufacturing operations,\" said the Clip Automation team.</blockquote><blockquote>Accessible on any device from browser-based dashboards, Clip Observability transforms reactive firefighting into proactive operational management with a unified source of truth for all stakeholders.</blockquote><h1>‍</h1>",
    "Tags": [
      "enterprise",
      "b2b",
      "saas",
      "iot",
      "manufacturing"
    ],
    "Skills": [
      "execution",
      "customer-research",
      "product-strategy",
      "communication",
      "design",
      "hardware-engineering"
    ]
  },
  {
    "Name": "HomeMetrics Water Monitor",
    "Slug": "water-monitor",
    "50 Character Description": "The Smart Home Water Damage Monitoring Service for Homeowners",
    "Startup Company": "homemetrics",
    "Featured": "true",
    "Sort Order": 5,
    "Product Type": "Product",
    "Summary": "This smart home IoT device monitors the health of a home's plumbing grid to predict and prevent water damage. Once installed, homeowners save money, time, and, most importantly, energy spent worrying about their home's health.",
    "Description": "This smart home IoT device monitors the health of a home's plumbing grid to predict and prevent water damage. Once installed, homeowners save money, time, and, most importantly, energy spent worrying about their home's health.",
    "Thumbnai Image": "/images/products/water-monitor-thumb.webp",
    "Project Image": "/images/products/water-monitor-project.webp",
    "Start Date": "Apr 01, 2019",
    "End Date": "Aug 01, 2020",
    "Highlights": "<ul id=\"\"><li id=\"\">Ran POCs with 5 homeowners, installing the HomeMetrics devices in 5 homes by leading a cross-functional team to design, build and deliver an IoT sensor network with Android/iOS mobile apps</li></ul><ul><li id=\"\">Hired and managed a team of 15 engineering interns for a year</li></ul><ul><li id=\"\">Raised $21,000 from 4 startup pitch competitions for R&amp;D</li></ul><ul><li id=\"\">Obtained 2 patents on water leak sensing technologies</li></ul><ul><li id=\"\">Conducted 50+ customer discovery interviews</li></ul>",
    "Press Release": "<blockquote id=\"\">HOMEMETRICS ANNOUNCES THE LAUNCH OF THE HOMEMETRICS WATER MONITOR FOR ABSENTEE HOMEOWNERS TO MONITOR AND PROTECT THEIR HOMES FROM WATER DAMAGE.</blockquote><blockquote id=\"\"><em id=\"\">Now, absentee homeowners who own secondary homes, vacation homes, or Airbnb rental properties can save time and money. More importantly, they can avoid worrying about their property's health, knowing that the HomeMetrics Water Monitor protects their homes from any plumbing-related emergency. </em></blockquote><blockquote id=\"\">Rapid City, South Dakota—Q3 2020—HomeMetrics, the proactive home health monitoring solution for predicting and preventing property damage, launched the HomeMetrics Water Monitor to provide 24/7 monitoring of a home's plumbing grid in search of leaks, floods, pipe breaks, water heater malfunctions, and more.</blockquote><blockquote id=\"\">Absentee homeowners lack real-time data about the health of their homes, leading to ill-informed property management decisions and thus costing them time and money. Often, homes will develop small water leaks; although these leaks are cheap to fix, they go unnoticed for months. In a worst-case scenario, the floor and walls near the leak rot with water damage. Often, a homeowner's insurance company denies their claim, choosing not to cover repair costs by pinning the blame on the homeowner's mistakes. In this case, the homeowner would pay for the repair costs and hundreds to thousands of dollars more due to the increased water usage. </blockquote><blockquote id=\"\">\"For every 100 mountain vacation homes, five will have a sewage tank that backs up, flooding into their basements every winter. Unfortunately, the time, stress, and effort spent dealing with these disasters is wasted. Ten years from now, I believe every newly constructed home will have smart home IoT devices installed which monitor both the plumbing and the electrical grids, ensuring the home's health is maintained.\" - Bill Trevillyan, Co-founder and CEO at HomeMetrics.</blockquote><blockquote id=\"\">For a one-time cost of $600, homeowners can install the HomeMetrics Water Monitor and have it monitor water pressure, flow rate, temperature, etc. Day or night, the system searches for leaks, floods, pipe breaks, water heater malfunctions, and more. The HomeMetrics mobile app gives homeowners complete visibility into their home's plumbing grid. First, homeowners are alerted to any abnormal behavior, such as constantly running water from a broken toilet seal or a pipe leak. In addition, they can turn the water to their house off when traveling away from home with the tap of a finger. They can even view their daily, weekly, monthly, and annual water usage trends. Finally, they can turn on Eco mode and regulate the water pressure coming into the house, extending the life span of appliances such as water heaters and reducing the home's annual water usage.</blockquote><blockquote id=\"\">\"The MetricsNetwork helps me save up to 3000 gallons of water a year!\" - Matt Irwin, a Rapid City, SD homeowner.</blockquote><blockquote id=\"\">Learn more at <a href=\"http://HomeMetrics.io\" id=\"\">HomeMetrics.io</a> or contact our team at <a href=\"info@homemetrics.io\" id=\"\">info@homemetrics.io</a>.</blockquote>",
    "Services Text": "<h2 id=\"\"><strong id=\"\">Wireframes</strong></h2><p>‍</p><p id=\"\">In this section, we offer a glimpse into the conceptualization phase of our projects through wireframes. Wireframes are the architectural blueprints of digital experiences, representing the foundation upon which we build remarkable websites. Here, you can explore our thoughtfully crafted wireframes that lay the groundwork for seamless and user-friendly designs.</p><p>‍</p><h2 id=\"\"><strong id=\"\">Highlights:</strong></h2><p>‍</p><ol id=\"\"><li><strong id=\"\">User-Centric Design:</strong> Our wireframes prioritize user experience, mapping out intuitive navigation, content hierarchy, and interaction points that put users at the forefront of design.</li><li><strong id=\"\">Responsive Blueprint:</strong> We've meticulously planned for responsiveness, ensuring that our designs adapt seamlessly to various screen sizes, guaranteeing a consistent experience on desktops, tablets, and mobile devices.</li><li><strong id=\"\">Strategic Content Placement:</strong> Our wireframes reveal the strategic placement of content, imagery, and call-to-action elements, optimizing engagement and conversion pathways.</li><li><strong id=\"\">Iterative Refinement:</strong> Crafting these wireframes involved numerous iterations and collaborative feedback sessions to ensure they perfectly aligned with our client's vision and objectives.</li></ol><p>‍</p><h2 id=\"\"><strong id=\"\">Challenges</strong></h2><p>‍</p><p id=\"\">In this section, we provide an insightful look into the challenges we encountered during the development journey of our client projects. Challenges are opportunities in disguise, and it's in these moments that our team's expertise and problem-solving abilities truly shine.</p><p>‍</p><p id=\"\"><strong id=\"\">Notable Challenges:</strong></p><p>‍</p><ol id=\"\"><li><strong id=\"\">Complex Functionality:</strong> Our clients often demand intricate functionalities, such as e-commerce integration and custom user dashboards, which require innovative solutions and rigorous testing.</li><li><strong id=\"\">Performance Optimization:</strong> Achieving top-tier performance while maintaining feature-rich websites necessitates extensive optimization, including image compression, code refinement, and server-side enhancements.</li><li><strong id=\"\">Security Prioritization:</strong> Data privacy and cybersecurity are paramount. We implemented robust security measures to safeguard sensitive user information, ensuring a safe online environment.</li><li><strong id=\"\">Browser Compatibility:</strong> Ensuring that our websites function seamlessly across a multitude of browsers and devices required exhaustive testing and meticulous debugging.</li></ol><p>‍</p><h2 id=\"\"><strong id=\"\">Conclusion</strong></h2><p>‍</p><p id=\"\">In the conclusion segment of our portfolio, we celebrate the successful outcomes of our collaborations with clients. This is where the narrative of our partnerships reaches its apex, spotlighting achievements, milestones, and the profound impact of our work.</p>",
    "Website": "Water Module Documentation",
    "Live Link": "https://www.homemetrics.io/#/products",
    "Tags": [
      "b2c",
      "smart-home-tech"
    ],
    "Skills": [
      "execution",
      "prioritization",
      "customer-research",
      "product-strategy",
      "communication"
    ]
  },
  {
    "Name": "AppFolio Sync",
    "Slug": "appfolio-sync",
    "50 Character Description": "A one-way data-sync integration between Appfolio and Property Meld using scheduled CSV reports",
    "Startup Company": "property-meld",
    "Featured": "false",
    "Sort Order": 6,
    "Product Type": "Product",
    "Summary": "This key product offering uses scheduled CSV reports delivered via email to populate a property managers maintenance management software with key property data from their accounting software.",
    "Description": "This key product offering uses scheduled CSV reports delivered via email to populate a property manager's maintenance management software with key property data from their accounting software. For property managers using the industry-leading accounting software Appfolio. The Appfolio Sync service automatically populates Property Meld, their maintenance management solution, with data stored in Appfolio. Specifically, all maintenance-related data associated with property owners, properties, units, and tenants are added and kept up-to-date in Property Meld via a daily data-sync service.",
    "Thumbnai Image": "/images/products/appfolio-sync-thumb.webp",
    "Project Image": "/images/products/appfolio-sync-project.webp",
    "Start Date": "Jun 01, 2021",
    "End Date": "Oct 01, 2021",
    "Highlights": "<ul id=\"\"><li id=\"\">Helped achieve 73% revenue growth and 112% net-revenue-retention in 2021 by removing the Sales Team’s #1 rejection reason and the Customer Success Team’s #1 churn reason: the lack of an AppFolio Integration leads to duplicate data entry and significant discrepancies between each system</li></ul><ul><li id=\"\">Forced our largest competitor, who historically refused to integrate with us, to provide a 2-way data sync API integration by leading a cross-functional team to design, build, and launch a primitive 1-way data sync leveraging scheduled CSV reports, resulting in overwhelming pressure from their customer base</li></ul><ul><li id=\"\">Conducted 20+ customer discovery interviews</li></ul>",
    "Press Release": "<blockquote id=\"\">PROPERTY MELD ANNOUNCES APPFOLIO SYNC TO SYNC PROPERTY DATA BETWEEN APPFOLIO AND PROPERTY MELD.</blockquote><blockquote id=\"\"><em id=\"\">Now, property management companies that use both Property Meld’s maintenance management system and Appfolio’s accounting software can save hours of time each day by auto-populating their Property Meld account with property information stored in Appfolio.</em></blockquote><blockquote id=\"\">Rapid City, South Dakota—Q4 2021—Property Meld, the leading maintenance management solution for single-family property management firms, released Appfolio Sync to help save property management firms hours of their time each day.</blockquote><blockquote id=\"\">Historically, property management firms using Appfolio, the industry-leading accounting software, were forced to manually duplicate thousands of records from Appfolio into each of their other operations software, including Property Meld. This manual effort would take a property manager multiple hours every day. Due to human error, managers found large discrepancies in data accuracy between the two systems, leading to critical mistakes that cost thousands in maintenance expenses and took tens to hundreds of hours to fix.</blockquote><blockquote id=\"\">“Property Managers should spend their time and money doing what they do best, caring for properties on behalf of their customers, property owners, and investors. But for years, Meld users have had to manually add data to Property Meld because Appfolio has maintained a closed-off system, refusing to partner or integrate with other software services. We launched Appfolio Sync to end Appfolio’s monopolistic practices.” - John Smith, Product Leader at Property Meld.</blockquote><blockquote id=\"\">The Appfolio Sync saves property management firms time and money by syncing key data needed for managing maintenance into Property Meld from Appfolio. By scheduling CSV reports to be sent every morning from Appfolio to Property Meld’s designated email addresses, a property manager’s Property Meld account will auto-populate and auto-update owner, property, unit, and tenant details every morning so that operations can move forward without a hitch. If any data-integrity issues arise during a sync, property managers are immediately informed so they can correct the issue in Appfolio.</blockquote><blockquote id=\"\">“The Appfolio Sync is a game changer, allowing my team to save tens of hours each week manually importing property information into Meld. For the first time in months, our all-star maintenance coordinator was able to leave work by 5 pm last Friday. I’ve never seen her so happy.” - Jane Doe, President at ABC Property Management.</blockquote><blockquote id=\"\">Learn more at <a href=\"http://propertymeld.com\" id=\"\">propertymeld.com</a> or contact our team at <a href=\"support@propertymeld.com\" id=\"\">support@propertymeld.com</a>.</blockquote>",
    "Skills": [
      "customer-research",
      "communication",
      "execution",
      "prioritization",
      "product-strategy",
      "product-launches-and-marketing"
    ]
  },
  {
    "Name": "Incode Forms",
    "Slug": "incode-forms",
    "50 Character Description": "The No-code Builder for Identity Verification Onboarding Questionnaires",
    "Startup Company": "incode-technologies",
    "Featured": "false",
    "Sort Order": 7,
    "Product Type": "Product",
    "Summary": "This product equips financial institutions with the ability to gather essential information from users throughout their onboarding process by utilizing a customizable questionnaire, which can be created effortlessly through a user-friendly, no-code interface.",
    "Description": "This product equips financial institutions with the ability to gather essential information from users throughout their onboarding process by utilizing a customizable questionnaire, which can be created effortlessly through a user-friendly, no-code interface.",
    "Thumbnai Image": "/images/products/incode-forms-thumb.webp",
    "Project Image": "/images/products/incode-forms-project.webp",
    "Start Date": "Oct 01, 2022",
    "End Date": "Dec 01, 2022",
    "Highlights": "<ul id=\"\"><li id=\"\">Led the discovery, design, and construction of a Figma prototype for Incode Forms</li></ul><ul><li id=\"\">Closed $X million in revenue by demoing the prototype to a large prospect that was about to sign a contract with a competitor, convincing them to choose Incode instead</li></ul><ul><li id=\"\">Built trust between the Sales, Engineering and Product Teams by delivering a prototype that would satisfy the Sales Team’s needs while finding a solution that wouldn’t require development effort from the Engineering Team until a contract with the prospect had been signed</li></ul>",
    "Press Release": "<blockquote id=\"\">INCODE ANNOUNCES INCODE FORMS TO PROVIDE ENTERPRISES WITH CUSTOMIZABLE QUESTIONNAIRES FOR THEIR IDENTITY VERIFICATION EXPERIENCES.</blockquote><blockquote id=\"\"><em id=\"\">Now, enterprises that use Incode's biometric identity verification solutions can present custom questionnaires to their customers during digital onboarding, authentication, and identity verification experiences.</em></blockquote><blockquote id=\"\">San Francisco, California—Q1 2023—Incode, the next-generation identity verification and authentication platform for global enterprises, released Incode Forms to provide enterprises with custom questionnaires. Financial institutions, hospitals, gig-economy employers, and more can present custom questions to their customers and retrieve key information related to digital onboarding, authentication, and identity verification experiences.</blockquote><blockquote id=\"\">A B2C technology company must first maximize the adoption of its technology to effectively deliver value to its users and grow its user base. To maximize adoption, they need to maximize their onboarding conversion rates; however, minimizing fraud while maximizing onboarding conversion is difficult and can cost extensive design and engineering resources. Most companies lack the expertise and the time to solve this problem.</blockquote><blockquote id=\"\">\"B2C technology companies spend too much time designing, implementing, and optimizing onboarding experiences when they could invest their limited engineering resources in their core technologies and solve core customer problems. Thus, we are launching Incode Forms so that these companies can get back to focusing on what they do best, delivering value to their customers.\" - William Trevillyan, Product Leader at Incode.</blockquote><blockquote id=\"\">Incode Forms, the no-code builder for onboarding questionnaires, saves B2C technology companies time and engineering resources by allowing them to design a questionnaire that is served to users who undergo onboarding, authentication, or identity verification experiences. With no development effort, they can orchestrate which questions are shown and when. Finally, they can prompt users with single-choice, multi-choice, or short-answer questions such as \"What is your household's annual income?\" \"What city were you born in?\" and \"What size of loan would you like to request?\"</blockquote><blockquote id=\"\">\"Incode Forms was an easy and fast solution for configuring our entire onboarding experience to maximize conversion while minimizing fraud. I can now direct my attention back to delivering value for our customers.\" - Jane Doe, Executive at ABC Hospitals.</blockquote><blockquote id=\"\">To learn more, please contact our team<a href=\"https://incode.com/contact-us/\" id=\"\">&nbsp;here</a> at<a href=\"https://incode.com/\" id=\"\">&nbsp;Incode Technologies</a>.</blockquote>",
    "Skills": [
      "customer-research",
      "communication",
      "prioritization",
      "execution"
    ]
  },
  {
    "Name": "Incode Concierge",
    "Slug": "incode-concierge",
    "50 Character Description": "A CCTV facial recognition service that enables hospitality enterprises to provide best-in-class concierge services",
    "Startup Company": "incode-technologies",
    "Featured": "false",
    "Product Type": "Product",
    "Summary": "Incode Concierge uses a facility’s CCTV camera system and biometric identity-detection technology to inform businesses when valued customers are present so staff can immediately attend to a VIP’s needs.",
    "Description": "Incode Concierge uses a facility’s CCTV camera system and biometric identity-detection technology to inform businesses when valued customers are present; staff, in turn, can immediately attend to a VIP’s needs, whether they be digital or physical.",
    "Thumbnai Image": "/images/products/incode-concierge-thumb.webp",
    "Project Image": "/images/products/incode-concierge-project.webp",
    "Start Date": "Oct 01, 2022",
    "End Date": "Jan 28, 2023",
    "Highlights": "<ul id=\"\"><li id=\"\">Successfully aligned the CEO and VPs of engineering, machine learning, and hardware on the product vision and requirements for Incode Concierge by writing a 2-page narrative and leading three 30-min. discussions to unblock the engineering team and deliver the product to 2 pre-paid customers</li></ul><ul><li id=\"\">Proposed and achieved alignment with the company's executives on the key decision that Incode would not provide personal identifiable information (PII) to clients in order to protect our brand as a non-surveillance identity tech company</li></ul>",
    "Press Release": "<blockquote id=\"\">INCODE ANNOUNCES INCODE CONCIERGE TO EMPOWER HOSPITALITY ENTERPRISES WITH IDENTITY-DRIVEN VIP CONCIERGE SERVICES.</blockquote><blockquote id=\"\"><em id=\"\">Now, hospitality enterprises that use Incode’s biometric identity verification solutions can provide best-in-class concierge services to their most valued customers.</em></blockquote><blockquote id=\"\">San Francisco, California—Q4 2022—Incode, the next-generation identity verification and authentication platform for global enterprises, released Incode Concierge to enable hospitality enterprises with identity-driven concierge services. Hotel chains, casinos, banks, and retail stores can provide their VIPs with immediate and top-tier digital and physical services as soon as VIPs enter their facilities by knowing exactly when they arrive.</blockquote><blockquote id=\"\">Banks, casinos, hotels, stores, hospitals, and government offices receive many visitors daily. A select few of these visitors are so important that they are added to “VIP” lists. But how does the business know when a VIP arrives at their facility? Often, these VIPs wait in lines, receive cold greetings from staff, and are treated as just another customer. Worst case, they leave irritated and churn. </blockquote><blockquote id=\"\">“Consumers have grown accustomed to instant gratification through products and services such as Netflix, Doordash, and Amazon. These same consumers have learned to expect immediate top-tier customer service from businesses. Thus, Incode is making a large step towards enabling hospitality enterprises to step up and provide the next level of concierge services.” - John Smith, Product Leader at Incode.</blockquote><blockquote id=\"\">Incode Concierge uses a facility’s CCTV camera system and biometric identity-detection technology to inform businesses when valued customers are present; staff, in turn, can immediately attend to a VIP’s needs, whether they be digital or physical.</blockquote><blockquote id=\"\">“As the leader of ABC Hotels, I found that Incode Concierge enabled us to elate our most valuable clients when they least expected it, building trust and loyalty that will last a lifetime.” - Jane Doe. </blockquote><blockquote id=\"\">To learn more, please contact our team<a href=\"https://incode.com/contact-us/\" id=\"\">&nbsp;here</a> at<a href=\"https://incode.com/\" id=\"\">&nbsp;Incode Technologies</a>.</blockquote>",
    "Skills": [
      "communication",
      "customer-research",
      "product-strategy",
      "prioritization"
    ]
  },
  {
    "Name": "NewsNook",
    "Slug": "newsnook",
    "50 Character Description": "The AI-powered newsletter reader for thought leaders and executives",
    "Startup Company": "newsnook",
    "Featured": "false",
    "Product Type": "Product",
    "Summary": "NewsNook is a novel AI-powered application that helps thought leaders and executives streamline the consumption of their daily and weekly newsletters.",
    "Description": "NewsNook is a novel AI-powered application that helps thought leaders and executives streamline the consumption of their daily and weekly newsletters.",
    "Thumbnai Image": "/images/products/newsnook-thumb.webp",
    "Project Image": "/images/products/newsnook-project.webp",
    "Start Date": "Feb 01, 2024",
    "End Date": "Dec 31, 2024",
    "Highlights": "<ul id=\"\"><li id=\"\">Acquired 3 paying customers for $XXX in revenue and a beta waitlist consisting of 70+ C-suite executives by building a landing page using Webflow and running digital marketing campaigns</li></ul><ul><li id=\"\">Delivered a beta product to initial customers by building a progressive web app using Dart, Typescript, Javascript, Vercel, NextJS, Supabase DB, Supabase Edge, Trigger.dev, Google APIs, and FlutterFlow</li></ul><ul><li id=\"\">Conducted customer development interviews and user interviews by building multiple low-fidelity and high-fidelity Figma design prototypes</li></ul><ul><li id=\"\">Conducted customer discovery interviews with executives and thought leaders who regularly consume newsletters as their primary source of news</li></ul>",
    "Press Release": "<blockquote>NEWSNOOK ANNOUNCES THE LAUNCH OF ITS AI-POWERED NEWSLETTER READER.</blockquote><blockquote><em>Now, thought leaders and executives, no longer bound by the burden of combing through cluttered email inboxes, can liberate their mornings and quickly consume their news in one place with ease.</em></blockquote><blockquote>San Francisco, California—Q3 2024—NewsNook, the AI-powered newsletter reader for thought leaders and executives, has launched a single app for quickly finding, reading, storing, and managing newsletters and news articles.</blockquote><blockquote>Daily, executives and thought leaders worldwide read news feeds that they have carefully curated for their specific industries, jobs, and current projects. These news feeds, more often than not, are comprised of a multitude of newsletters and blogs that they follow. Most of them spend an hour or more every morning combing through their cluttered email inbox to read the most recent newsletters and blog posts that they have received. Their current process doesn’t only waste valuable time. These avid readers waste effort logging what they have read and learned in various external applications. Typically, these executives follow and read through dozens of newsletters, which often overlap with the information they present, which is inefficient. &nbsp;</blockquote><blockquote>“An executive’s most important job is to determine the direction of their company and communicate their vision to the rest of their organization. The best leaders do this by writing and thinking deeply about their industry, which requires being well-informed and well-organized. NewsNook exists to help executives and thought leaders be intentional and organized when consuming news. The result is these executives save time while delivering higher quality leadership to their companies.” - Bill Trevillyan, Co-founder and CEO at NewsNook.</blockquote><blockquote>For $20 per month, NewsNook users can easily find and consume newsletters and news articles from a personally curated news feed, and have the power to finely control this news feed. For example, users can customize their newsletter “playlist”, controlling which newsletters they read in which order every morning. In addition, the NewsNook AI-assistant helps readers quickly navigate to the most relevant and significant news, avoiding repeat stories and unnecessary filler or fluff. If a reader needs to perform an action while in the middle of reading a piece, they can make a note, highlight a key point, and ask the AI-assistance for a definition or more information from the internet. After a reader finishes a news piece, they tag and archive it, making it easy to reference at a later date.</blockquote><blockquote>“Not only am I saving time on news consumption every morning, but I feel better informed and more equipped to lead my company. Thank you, NewsNook!” - Jane Doe, CEO at ABC Company.</blockquote><blockquote>Learn more at <a href=\"https://NewsNook.io\">NewsNook.io</a> or contact our team at <a href=\"info@newsnook.io\">info@newsnook.io</a>.</blockquote>",
    "Website": "https://newsnook.io?utm_source=bills_product_portfolio",
    "Tags": [
      "saas",
      "b2c",
      "mobile-app",
      "web-application"
    ],
    "Skills": [
      "product-launches-and-marketing",
      "customer-research",
      "prioritization",
      "product-strategy"
    ]
  },
  {
    "Name": "Speech Analysis API",
    "Slug": "speech-analysis-api",
    "50 Character Description": "The Enterprise API for Evaluating Verbal Communication Effectiveness",
    "Startup Company": "verbaly",
    "Featured": "false",
    "Product Type": "Product",
    "Summary": "This product equips enterprises with a REST-based API where they can send recordings of conversations or speeches. In return, they receive an analysis of the speech.",
    "Description": "This product equips enterprises with a REST-based API where they can send recordings of conversations or speeches. In return, they receive a speech analysis with dozens of quantitative and qualitative metrics.",
    "Thumbnai Image": "/images/products/speech-analysis-api-thumb.webp",
    "Project Image": "/images/products/speech-analysis-api-project.webp",
    "Start Date": "Nov 01, 2023",
    "End Date": "Apr 01, 2024",
    "Highlights": "<ul id=\"\"><li id=\"\">Delivered an enterprise speech analysis API MVP as part of a 6-month sales conversation with the Bank of America</li></ul><ul><li id=\"\">Led sales discussions with 4 prospective clients looking for speech analysis services</li></ul>",
    "Press Release": "<blockquote id=\"\">VERBALY ANNOUNCES THE LAUNCH OF ITS ENTERPRISE API FOR SPEECH ANALYSIS</blockquote><blockquote id=\"\"><em id=\"\">Technology enterprises looking to build speech-related products or services can now leverage Verbaly’s API to analyze speech patterns and verbal communication skills.</em></blockquote><blockquote id=\"\">San Francisco, California—Q4 2023—Verbaly, the AI speech coach to replace Toastmasters, released the Verbaly Enterprise API to provide technology enterprises with a quick, low-effort solution for objectively analyzing speech patterns and verbal communication skills in real time.</blockquote><blockquote id=\"\">Over the last year, enterprises have witnessed the rapid disruption of AI technologies. The recruitment industry has specifically noticed new AI-powered tools and applications popping up daily. With this trend, many recruitment technology companies have found a need to quickly implement interview analysis and interview coaching products for their customers, especially for recruitment operations related to non-native English-speaking roles. One of the most significant technical challenges involved in developing interview analysis and coaching technology is building an automated solution to objectively analyze a candidate’s communication skills, producing quantitative and qualitative feedback. This challenge leads technology enterprises to suffer from issues such as slow product development, delayed product launches, high maintenance expenses, and, most importantly, a less enticing value proposition compared to their competitors.</blockquote><blockquote id=\"\">“In this highly competitive and rapidly changing technology environment, enterprises need to focus their resources on their strengths and expertise while outsourcing all the other aspects of their business to survive. That is why we launched the Verbaly Enterprise API as the all-in-one speech analysis solution for technology enterprises so that they could quickly acquire speech analysis solutions without diverting resources away from their core business.” - Bill Trevillyan, Co-founder and CEO at Verbaly.</blockquote><blockquote id=\"\">The Verbaly API equips technology enterprises with a REST-based API that offers unparalleled flexibility. They can send a live-stream of audio or a recording of a person or persons speaking, and in return, receive a speech analysis relating to the people’s verbal communication skills. The quantitative metrics and qualitative feedback resulting from each speech analysis can be tuned to various speaking scenarios and environments such as a job interview, a public speaking event, a workplace conversation between colleagues, small talk between neighbors and more. This flexibility ensures the feedback and metrics are accurate, consistent and applicable to the given situation, empowering enterprises to tailor their solutions to their specific needs.</blockquote><blockquote id=\"\">“By choosing Verbaly as our speech analysis solution, we saved millions of dollars and years of time, avoiding the development of an in-house solution.” - Jane Doe, Product Manager at ABC Company.</blockquote><blockquote id=\"\">Learn more at <a href=\"http://Verbaly.ai/api\" id=\"\">Verbaly.ai/API</a> or contact our team at <a href=\"info@verably.ai\" id=\"\">info@verably.ai</a>.</blockquote>",
    "Website": "https://www.verbaly.ai/api?utm_source=bills_product_portfolio",
    "Skills": [
      "customer-research",
      "execution",
      "product-strategy"
    ]
  }
]